//Створити суперклас Будівля і підкласи Громадська Будівля, Житлова Будівля, Кінотеатр, Готель, П’ятиповерхівка, Ресторан.
//Подумати, які з вищенаведених підкласів також можуть бути суперкласами.  За допомогою конструктора задати дату побудови будівлі.
//Визначити вартість оренди одного місця в будівлі. Визначити вартість вхідного квитка в громадську будівлю. Визначити місткість будівлі.

class Program
{
    static void Main(string[] args)
    {
        // Створення об'єкту готелю
        Hotel myHotel = new Hotel(2020, 1500, "Панорама", "Готель", 50);
        Console.WriteLine("Про готель!");
        myHotel.PrintInfo();

        // Створення об'єкту кінотеатру
        Kino myCinema = new Kino(2015, 300, 5, "Кінопалац");
        Console.WriteLine("\nПро кінотеатр!");
        myCinema.PrintInfo();

        // Створення об'єкту п'ятиповерхового будинку
        FiveF myBuilding = new FiveF(2000, 5000, 20);
        Console.WriteLine("\nПро п'ятиповерхівку!");
        myBuilding.PrintInfo();

        // Створення об'єкту ресторану
        Restaur myRestaurant = new Restaur(2018, 1000, 10);
        Console.WriteLine("\nПро ресторан!");
        myRestaurant.PrintInfo();
    }
}